<?php
// +----------------------------------------------------------------------
// | 系统：YIPUCMS
// +----------------------------------------------------------------------
// | Copyright (c) 2012 YIPU All rights reserved.
// +----------------------------------------------------------------------
// | 本系统采用THINKPHP3.1框架开发
// +----------------------------------------------------------------------
// | 作者: YIPU <719655143@qq.com>
// +----------------------------------------------------------------------
// | 页面创建时间: 2012-11-24
// +----------------------------------------------------------------------


class CommentModel extends Model {
	protected $_map = array(
        'id'  => 'review_id',
	    'md'  => 'module',
	    'recordid' => 'record_id', 
	    'state' => 'status'
    );	
	
    protected $_auto = array(
        array('time', 'time', 1 , 'function'),
    );
		// array(验证字段,验证规则,错误提示,[验证条件,附加规则,验证时间])
	protected $_validate = array(
		array('content','require','请填写评论内容','1'), // 分类名称必须
    );

}
?>