<?php
// +----------------------------------------------------------------------
// | 系统：YIPUCMS
// +----------------------------------------------------------------------
// | Copyright (c) 2012 YIPU All rights reserved.
// +----------------------------------------------------------------------
// | 本系统采用THINKPHP3.1框架开发
// +----------------------------------------------------------------------
// | 作者: YIPU <719655143@qq.com>
// +----------------------------------------------------------------------
// | 页面创建时间: 2012-12-24
// +----------------------------------------------------------------------


class MessageModel extends Model {
	protected $_map = array(
        'uname'  => 'user', 
		'neirong'  => 'content', 
    );	
	
    protected $_auto = array(
        array('creattime', 'time', 1 , 'function'),
    );
		// array(验证字段,验证规则,错误提示,[验证条件,附加规则,验证时间])
	protected $_validate = array(
		array('user','require','请填写昵称！','1'), // 分类名称必须
		array('content','require','请填写评论内容！','1'), // 分类名称必须
    );

}
?>