<?php
// +----------------------------------------------------------------------
// | 系统：YIPUCMS
// +----------------------------------------------------------------------
// | Copyright (c) 2012 YIPU All rights reserved.
// +----------------------------------------------------------------------
// | 本系统采用THINKPHP3.1框架开发
// +----------------------------------------------------------------------
// | 作者: YIPU <719655143@qq.com>
// +----------------------------------------------------------------------
// | 页面创建时间: 2012-09-28
// +----------------------------------------------------------------------


class AjaxAction extends Action {
	
	function getsort(){
		$Sort = M('Sort');
		$con['moduleid']=$_REQUEST['mid'];
        import("@.ORG.Tree");
        $cat = new Tree('Sort', array('id', 'pid', 'name', "cname"));
        $list = $cat->getList($con); //获取分类结构	
		$data['status'] = 1;
        $data['list'] = $list;
		$this->ajaxReturn($data);
	}

}
?>